#. . 0 0 . 0 0 . . 9
#. 0 0 0 0 0 0 0 .
#. 0 0 0 0 0 0 0 .
#. . 0 0 0 0 0 . .
#. . . 0 0 0 . . .
#. . . . 0 . . . .
# 6
#1. Идея: тупое перерисовывание с сокращениями
#2. Идея: каким то образом найти формулу для переворачивания адресов(вывести) +

grid =  [['░░','░░','░░','░░','░░','░░'],
         ['░░','██','██','░░','░░','░░'],
         ['██','██','██','██','░░','░░'],
         ['██','██','██','██','██','░░'],
         ['░░','██','██','██','██','██'],
         ['██','██','██','██','██','░░'],
         ['██','██','██','██','░░','░░'],
         ['░░','██','██','░░','░░','░░'],
         ['░░','░░','░░','░░','░░','░░']]

def inver(lit):
    hashi = []
    for x in range(len(lit[0])):
        row = []
        for y in range(len(lit)):
            row.append(lit[y][x])
        hashi.append(row)
    return hashi

def viz(come):
    for y in range(len(come)):
        for x in range(len(come[y])):
            print(come[y][x], end=' ')
        print('\n', end='')

viz(inver(grid))